In [2]:
# install ipython-sql
!pip install prettytable==3.7.0 --force-reinstall

Collecting prettytable==3.7.0
  Downloading prettytable-3.7.0-py3-none-any.whl.metadata (26 kB)
Collecting wcwidth (from prettytable==3.7.0)
  Using cached wcwidth-0.2.13-py2.py3-none-any.whl.metadata (14 kB)
Downloading prettytable-3.7.0-py3-none-any.whl (27 kB)
Using cached wcwidth-0.2.13-py2.py3-none-any.whl (34 kB)
Installing collected packages: wcwidth, prettytable
  Attempting uninstall: wcwidth
    Found existing installation: wcwidth 0.2.13
    Uninstalling wcwidth-0.2.13:
      Successfully uninstalled wcwidth-0.2.13
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.15.1
    Uninstalling prettytable-3.15.1:
      Successfully uninstalled prettytable-3.15.1
Successfully installed prettytable-3.7.0 wcwidth-0.2.13

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
# import libraries
import sqlite3
import pandas as pd

In [6]:
# read the dataset:
df = pd.read_csv('menu_items.csv')
df

    menu_item_id              item_name  category  price
0            101              Hamburger  American  12.95
1            102           Cheeseburger  American  13.95
2            103                Hot Dog  American   9.00
3            104          Veggie Burger  American  10.50
4            105           Mac & Cheese  American   7.00
5            106           French Fries  American   7.00
6            107         Orange Chicken     Asian  16.50
7            108          Tofu Pad Thai     Asian  14.50
8            109       Korean Beef Bowl     Asian  17.95
9            110             Pork Ramen     Asian  17.95
10           111        California Roll     Asian  11.95
11           112            Salmon Roll     Asian  14.95
12           113                Edamame     Asian   5.00
13           114            Potstickers     Asian   9.00
14           115          Chicken Tacos   Mexican  11.95
15           116            Steak Tacos   Mexican  13.95
16           117        Chicken Burrito   Mexican  12.95
17           118          Steak Burrito   Mexican  14.95
18           119          Chicken Torta   Mexican  11.95
19           120            Steak Torta   Mexican  13.95
20           121     Cheese Quesadillas   Mexican  10.50
21           122          Chips & Salsa   Mexican   7.00
22           123      Chips & Guacamole   Mexican   9.00
23           124              Spaghetti   Italian  14.50
24           125  Spaghetti & Meatballs   Italian  17.95
25           126     Fettuccine Alfredo   Italian  14.50
26           127           Meat Lasagna   Italian  17.95
27           128         Cheese Lasagna   Italian  15.50
28           129       Mushroom Ravioli   Italian  15.50
29           130          Shrimp Scampi   Italian  19.95
30           131       Chicken Parmesan   Italian  17.95
31           132      Eggplant Parmesan   Italian  16.95

In [4]:
# Create a connection to a sqlite database (It will create one if it doesn't exist)
conn = sqlite3.connect("example_1.db")

In [ ]:
"""query = "SELECT * FROM menu LIMIT 5"
df = pd.read_sql(query, conn)

print(df)"""

   menu_item_id      item_name  category  price
0           101      Hamburger  American  12.95
1           102   Cheeseburger  American  13.95
2           103        Hot Dog  American   9.00
3           104  Veggie Burger  American  10.50
4           105   Mac & Cheese  American   7.00

In [7]:
# Load the Dataframe into Sql table
df.to_sql('menu_items', conn, if_exists='replace', index=False)

32

In [8]:
# # Close the connection (important when using %sql magic later)
conn.close()

In [9]:
# Load the extension
%load_ext sql

In [22]:
%reload_ext sql

In [10]:
# connect to sqlite database
%sql sqlite:///example_1.db

## 1. View the "menu_items" Table.

In [40]:
%%sql

SELECT * FROM menu_items;

 * sqlite:///example_1.db
Done.

[(101, 'Hamburger', 'American', 12.95),
 (102, 'Cheeseburger', 'American', 13.95),
 (103, 'Hot Dog', 'American', 9.0),
 (104, 'Veggie Burger', 'American', 10.5),
 (105, 'Mac & Cheese', 'American', 7.0),
 (106, 'French Fries', 'American', 7.0),
 (107, 'Orange Chicken', 'Asian', 16.5),
 (108, 'Tofu Pad Thai', 'Asian', 14.5),
 (109, 'Korean Beef Bowl', 'Asian', 17.95),
 (110, 'Pork Ramen', 'Asian', 17.95),
 (111, 'California Roll', 'Asian', 11.95),
 (112, 'Salmon Roll', 'Asian', 14.95),
 (113, 'Edamame', 'Asian', 5.0),
 (114, 'Potstickers', 'Asian', 9.0),
 (115, 'Chicken Tacos', 'Mexican', 11.95),
 (116, 'Steak Tacos', 'Mexican', 13.95),
 (117, 'Chicken Burrito', 'Mexican', 12.95),
 (118, 'Steak Burrito', 'Mexican', 14.95),
 (119, 'Chicken Torta', 'Mexican', 11.95),
 (120, 'Steak Torta', 'Mexican', 13.95),
 (121, 'Cheese Quesadillas', 'Mexican', 10.5),
 (122, 'Chips & Salsa', 'Mexican', 7.0),
 (123, 'Chips & Guacamole', 'Mexican', 9.0),
 (124, 'Spaghetti', 'Italian', 14.5),
 (125, 'Spaghetti & Meatballs', 'Italian', 17.95),
 (126, 'Fettuccine Alfredo', 'Italian', 14.5),
 (127, 'Meat Lasagna', 'Italian', 17.95),
 (128, 'Cheese Lasagna', 'Italian', 15.5),
 (129, 'Mushroom Ravioli', 'Italian', 15.5),
 (130, 'Shrimp Scampi', 'Italian', 19.95),
 (131, 'Chicken Parmesan', 'Italian', 17.95),
 (132, 'Eggplant Parmesan', 'Italian', 16.95)]

## 2. Find the number of items on the menu.

In [36]:
%%sql

SELECT COUNT(*) FROM menu_items;

 * sqlite:///example_1.db
Done.

[(32,)]

## 3. What are the least and most expensive items on the menu.

In [51]:
%%sql

SELECT * FROM menu_items ORDER BY price LIMIT 1;

 * sqlite:///example_1.db
Done.

[(113, 'Edamame', 'Asian', 5.0)]

In [52]:
%%sql

SELECT * FROM menu_items ORDER BY price DESC LIMIT 1;

 * sqlite:///example_1.db
Done.

[(130, 'Shrimp Scampi', 'Italian', 19.95)]

## 4. Count how many italian dish on the menu.

In [53]:
%%sql

SELECT * FROM menu_items
WHERE category = 'Italian';

 * sqlite:///example_1.db
Done.

[(124, 'Spaghetti', 'Italian', 14.5),
 (125, 'Spaghetti & Meatballs', 'Italian', 17.95),
 (126, 'Fettuccine Alfredo', 'Italian', 14.5),
 (127, 'Meat Lasagna', 'Italian', 17.95),
 (128, 'Cheese Lasagna', 'Italian', 15.5),
 (129, 'Mushroom Ravioli', 'Italian', 15.5),
 (130, 'Shrimp Scampi', 'Italian', 19.95),
 (131, 'Chicken Parmesan', 'Italian', 17.95),
 (132, 'Eggplant Parmesan', 'Italian', 16.95)]

In [54]:
%%sql

SELECT COUNT(*) FROM menu_items
WHERE category = 'Italian';

 * sqlite:///example_1.db
Done.

[(9,)]

## 5. What are the least and most expensive italian dishes on the menu.

In [60]:
%%sql

SELECT  * FROM menu_items
WHERE category = 'Italian'
ORDER BY price LIMIT 1;

 * sqlite:///example_1.db
Done.

[(124, 'Spaghetti', 'Italian', 14.5)]

In [59]:
%%sql

SELECT  * FROM menu_items
WHERE category = 'Italian'
ORDER BY price DESC LIMIT 1;

 * sqlite:///example_1.db
Done.

[(130, 'Shrimp Scampi', 'Italian', 19.95)]

## 6. How many dishes are there in each category.

In [63]:
%%sql

SELECT category, COUNT('menu_items_id') as Number_of_dishes
FROM menu_items
GROUP BY category;

 * sqlite:///example_1.db
Done.

[('American', 6), ('Asian', 8), ('Italian', 9), ('Mexican', 9)]

## 7. What is the average dish price within each category?

In [69]:
%%sql

SELECT category, ROUND(AVG(price), 2) as average_price
FROM menu_items
GROUP BY category;

 * sqlite:///example_1.db
Done.

[('American', 10.07), ('Asian', 13.47), ('Italian', 16.75), ('Mexican', 11.8)]